package com.autosite.codegen.exception;


/**
 * <p>Description: 系统错误码</p>
 * @author hsh
 * @date 2017年10月29日
 */
public enum SysErrorCode {
//	/**
//	 * 系统异常
//	 */
//    SYS_ERROR_000000("000000", "系统异常-{0}", "请直接联系管理员"),
//    /**
//	 * 系统功能异常
//	 */
//    SYS_ERROR_000001("000001", "系统功能-{0}", "请重试，或者联系管理员"),
//    /**
//	 * 系统功能-操作异常
//	 */
//    SYS_ERROR_000011("000001", "操作异常-{0}", "请重试，或者联系管理员"),
//    /**
//	 *	登录用户信息异常
//	 */
//    SYS_ERROR_000002("000002", "用户信息-{0}", "请重试，或者联系管理员"),
//    /**
//	 *	用户无权操作异常
//	 */
//    SYS_ERROR_000003("000003", "用户权限-{0}", "对不起，你没有访问权限！"),
//	/**
//	 * 附件上传
//	 */
//    SYS_ERROR_100000("100000", "附件上传-{0}", "请重试，或者联系管理员"),
//	/**
//	 * 数据重复
//	 */
//    SYS_ERROR_200000("200000", "字段值重复-{0}", "请重新输入该字段的值"),
//	/**
//	 * 基础资源
//	 */
//    SYS_ERROR_300000("300000", "基础资源-{0}", "请重试，或者联系管理员"),
//	/**
//	 * 缺少参数
//	 */
//    SYS_ERROR_400000("400000", "缺少参数-{0}", "请重试，或者联系管理员"),
//    /**
//	 * 参数值错误
//	 */
//    SYS_ERROR_400001("400001", "参数值错误-{0}", "请重试，或者联系管理员"),
//    /**
//	 * 数据异常
//	 */
//    SYS_ERROR_500000("500000", "数据异常-{0}", "请重试，或者联系管理员"),
//	/**
//	 * 微信功能
//	 */
//    SYS_ERROR_700000("700000", "微信接口-{0}", "请重试，或者联系管理员"),
//    /**
//	 * 微信功能-未认证
//	 */
//    SYS_ERROR_700001("700001", "微信接口-{0}", "请重试，或者联系管理员"),
//    /**
//     * 文件上传路径错误
//     */
//    SYS_ERROR_800000("800000", "文件上传-{0}", "文件上传路径错误"),
//    /**
//     * httpClient错误
//     */
//    SYS_ERROR_900000("900000", "httpClient-{0}", "httpClient"),
//    /**
//     * 高级查询语法错误
//     */
//    SYS_ERROR_1000000("1000000", "高级查询-{0}", "语法错误"),

    /**
     * 城管登陆失败
     */
    SYS_ERROR_2000000("2000000", "城管接口-{0}", "登录失败"),
    /**
     * 城管网关超时
     */
    SYS_ERROR_2000001("2000001", "城管接口-{0}", "网关超时"),
    /**
     * 城管接口报错
     */
    SYS_ERROR_2000003("2000003", "城管接口-{0}", "接口报错"),
    /**
     * GS接口错误
     */
    SYS_ERROR_2000004("2000004", "GS接口-{0}", "GS接口返回错误"),
    /**
     * GS接口超时
     */
    SYS_ERROR_2000005("2000005", "GS接口-{0}", "GS接口超时"),
    /**
     * 主程序上传附件报错
     */
    SYS_ERROR_2000006("2000006", "主程序上传附件-{0}", "主程序上传附件报错"),
    /**
     * 主程序上传附件超时
     */
    SYS_ERROR_2000007("2000007", "主程序上传附件-{0}", "主程序上传附件超时"),
    /**
     * 城管上传附件报错
     */
    SYS_ERROR_2000008("2000008", "城管上传附件-{0}", "城管上传附件报错"),
    /**
     * 城管上传附件超时
     */
    SYS_ERROR_2000009("2000009", "城管上传附件-{0}", "城管上传附件超时"),
    /**
     * 城管附件查询报错
     */
    SYS_ERROR_2000010("2000010", "城管上传附件-{0}", "城管附件查询报错"),
    /**
     * 城管附件查询超时
     */
    SYS_ERROR_2000011("2000011", "城管上传附件-{0}", "城管附件查询超时"),
    /**
     * 附件下载报错
     */
    SYS_ERROR_2000012("2000012", "城管上传附件-{0}", "附件下载超时"),
    /**
     * 附件下载超时
     */
    SYS_ERROR_2000013("2000013", "附件下载-{0}", "附件下载报错"),

    /**
     * 系统配置错误
     */
    SYS_ERROR_3000000("3000000", "系统配置-{0}", "系统配置未配置"),
    /**
     * 城管机构配置错误
     */
    SYS_ERROR_3000001("3000001", "城管机构配置-{0}", "未找到相应机构"),
    /**
     * human配置错误
     */
    SYS_ERROR_3000002("3000002", "human配置-{0}", "human配置完善或未配置"),
    /**
     * 流向配置错误
     */
    SYS_ERROR_3000003("3000003", "流向配置-{0}", "流向未配置"),

    /**
     * kafka推送
     */
    SYS_ERROR_4000000("4000000", "kafka推送-{0}", "kafka推送报错"),
    /**
     * 城管接口报错-批转流向不存在
     */
    SYS_ERROR_5000000("5000000", "城管接口-{0}", "接口报错-批转流向不存在"),
    /**
     * 城管接口报错-列表中未找到案件
     */
    SYS_ERROR_5000001("5000001", "城管接口-{0}", "接口报错-列表中未找到案件"),
    /**
     * 城管接口报错-返回值错误
     */
    SYS_ERROR_5000002("5000002", "城管接口-{0}", "接口报错-返回值错误");


	private String errorCode;
    private String errorMsg;
    private String msgDetail;

    public String getMsgDetail() {
        return msgDetail;
    }

    public void setMsgDetail(String msgDetail) {
        this.msgDetail = msgDetail;
    }

    public String getErrorCode() {
        return errorCode;
    }

    public void setErrorCode(String errorCode) {
        this.errorCode = errorCode;
    }

    public String getErrorMsg() {
        return errorMsg;
    }

    public void setErrorMsg(String errorMsg) {
        this.errorMsg = errorMsg;
    }
    
    private SysErrorCode(String errorCode, String errorMsg, String msgDetail) {
        this.errorCode = errorCode;
        this.errorMsg = errorMsg;
        this.msgDetail = msgDetail;
    }

}
